run/simpleBattery/data/BextSidewalls0.5/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    sideWalls
    {
        type            epsilonWallFunction;
        value           uniform 0.1;
    }
    bottomWall
    {
        type            epsilonWallFunction;
        value           uniform 0.1;
    }
    lithiumInterface
    {
        type            epsilonWallFunction;
        value           uniform 0.1;
    }
    topSurface
    {
        type            inletOutlet;
        inletValue      uniform 0.1;
        value           uniform 0.1;
    }
}

// ************************************************************************* //
