run/simpleBattery/data/BextSidewalls0.5/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peratio 2.0
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulatio 2.0
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

xyRatio 1.0;
xyArea 22500;

x1 #calc "-0.5 * sqrt($xyArea / $xyRatio)"; 	// -50
x2 #calc "0.5 * sqrt($xyArea / $xyRatio)"; 	// 50
y1 #calc "$x1 * $xyRatio"; 			// -100
y2 #calc "$x2 * $xyRatio"; 			// 100
z1 0.0;
z2 50.0;

x3 #calc "$x1 * 0.68376068"; 			// -40
x4 #calc "$x2 * 0.68376068"; 			// 40
y3 #calc "$y1 * 0.81632653";			// -80
y4 #calc "$y2 * 0.81632653";			// 80
z3 34.0;
z4 50.0;

deltax 2.5;
deltay 2.5;
deltaz 2.5;

xLen1 #calc "$x2 - $x1";
yLen1 #calc "$y2 - $y1";
zLen1 #calc "$z2 - $z1";
xLen2 #calc "$x4 - $x3";
yLen2 #calc "$y4 - $y3";
zLen2 #calc "$z4 - $z3";

xC1 #calc "round($xLen1 / $deltax)";
xC2 #calc "round($xLen2 / 2*$deltax)";
yC1 #calc "round($yLen1 / $deltay)";
yC2 #calc "round($yLen2 / 4*$deltay)";
zC1 #calc "round($zLen1 / $deltaz)";
zC2 #calc "round($zLen2 / 2*$deltaz)";

vertices
(
    // Plane 1
    (  $x1   $y1   0 )
    (  $x1   $y3   0 )
    (  $x1   $y4   0 )
    (  $x1   $y2   0 )
    (  $x3   $y1   0 )
    (  $x3   $y3   0 )
    (  $x3   $y4   0 )
    (  $x3   $y2   0 )
    (  $x4   $y1   0 )
    (  $x4   $y3   0 )
    (  $x4   $y4   0 )
    (  $x4   $y2   0 )
    (  $x2   $y1   0 )
    (  $x2   $y3   0 )
    (  $x2   $y4   0 )
    (  $x2   $y2   0 )
    // Plane 2
    (  $x1   $y1   34 )
    (  $x1   $y3   34 )
    (  $x1   $y4   34 )
    (  $x1   $y2   34 )
    (  $x3   $y1   34 )
    (  $x3   $y3   34 )
    (  $x3   $y4   34 )
    (  $x3   $y2   34 )
    (  $x4   $y1   34 )
    (  $x4   $y3   34 )
    (  $x4   $y4   34 )
    (  $x4   $y2   34 )
    (  $x2   $y1   34 )
    (  $x2   $y3   34 )
    (  $x2   $y4   34 )
    (  $x2   $y2   34 )
    // Plane 3
    (  $x1   $y1   50 )
    (  $x1   $y3   50 )
    (  $x1   $y4   50 )
    (  $x1   $y2   50 )
    (  $x3   $y1   50 )
    (  $x3   $y3   50 )
    (  $x3   $y4   50 )
    (  $x3   $y2   50 )
    (  $x4   $y1   50 )
    (  $x4   $y3   50 )
    (  $x4   $y4   50 )
    (  $x4   $y2   50 )
    (  $x2   $y1   50 )
    (  $x2   $y3   50 )
    (  $x2   $y4   50 )
    (  $x2   $y2   50 )
);

blocks
(
    // Bottom blocks
    hex (0 4 5 1 16 20 21 17) ( 10 10 20 ) simpleGrading (5 5 0.2)
    hex (1 5 6 2 17 21 22 18) ( 10 40 20 ) simpleGrading (5 1 0.2)
    hex (2 6 7 3 18 22 23 19) ( 10 10 20 ) simpleGrading (5 0.2 0.2)
    hex (4 8 9 5 20 24 25 21) ( 20 10 20 ) simpleGrading (1 5 0.2)
    hex (5 9 10 6 21 25 26 22) ( 20 40 20 ) simpleGrading (1 1 0.2)
    hex (6 10 11 7 22 26 27 23) ( 20 10 20 ) simpleGrading (1 0.2 0.2)
    hex (8 12 13 9 24 28 29 25) ( 10 10 20 ) simpleGrading (0.2 5 0.2)
    hex (9 13 14 10 25 29 30 26) ( 10 40 20 ) simpleGrading (0.2 1 0.2)
    hex (10 14 15 11 26 30 31 27) ( 10 10 20 ) simpleGrading (0.2 0.2 0.2)
    // Top blocks
    hex (16 20 21 17 32 36 37 33) ( 10 10 10 ) simpleGrading (5 5 5)
    hex (17 21 22 18 33 37 38 34) ( 10 40 10 ) simpleGrading (5 1 5)
    hex (18 22 23 19 34 38 39 35) ( 10 10 10 ) simpleGrading (5 0.2 5)
    hex (20 24 25 21 36 40 41 37) ( 20 10 10 ) simpleGrading (1 5 5)
    // Solid lithium block missing
    hex (22 26 27 23 38 42 43 39) ( 20 10 10 ) simpleGrading (1 0.2 5)
    hex (24 28 29 25 40 44 45 41) ( 10 10 10 ) simpleGrading (0.2 5 5)
    hex (25 29 30 26 41 45 46 42) ( 10 40 10 ) simpleGrading (0.2 1 5)
    hex (26 30 31 27 42 46 47 43) ( 10 10 10 ) simpleGrading (0.2 0.2 5)
);

edges
(
);

patches
(
    wall sideWalls
    (
        // Bottom layer
        (0 16 17 1)
        (1 17 18 2)
        (2 18 19 3)
        (3 19 23 7)
        (7 23 27 11)
        (11 27 31 15)
        (15 31 30 14)
        (14 30 29 13)
        (13 29 28 12)
        (12 28 24 8)
        (8 24 20 4)
        (4 20 16 0)
        // Top layer
        (16 32 33 17)
        (17 33 34 18)
        (18 34 35 19)
        (19 35 39 23)
        (23 39 43 27)
        (27 43 47 31)
        (31 47 46 30)
        (30 46 45 29)
        (29 45 44 28)
        (28 44 40 24)
        (24 40 36 20)
        (20 36 32 16)
    )
    wall bottomWall
    (
        (0 1 5 4)
        (1 2 6 5)
        (2 3 7 6)
        (4 5 9 8)
        (5 6 10 9)
        (6 7 11 10)
        (8 9 13 12)
        (9 10 14 13)
        (10 11 15 14)
    )
    wall lithiumInterface
    (
        // Sides
        (21 22 38 37)
        (22 26 42 38)
        (26 25 41 42)
        (25 21 37 41)
        // Bottom
        (21 25 26 22)
    )
    patch topSurface
    (
        (32 36 37 33)
        (33 37 38 34)
        (34 38 39 35)
        (36 40 41 37)
        (38 42 43 39)
        (40 44 45 41)
        (41 45 46 42)
        (42 46 47 43)
    )
);


mergePatchPairs
(
);

// ************************************************************************* //
